disks/iodepth_numjobs/32_n16i16.log
job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes

job: (groupid=0, jobs=16): err= 0: pid=264612: Thu Aug 13 14:39:12 2020
   read: IOPS=536, BW=2144KiB/s (2196kB/s)(64.3MiB/30685msec)
    slat (nsec): min=3130, max=86490, avg=41214.45, stdev=7166.59
    clat (usec): min=33, max=1830.9k, avg=473891.35, stdev=176581.76
     lat (usec): min=45, max=1830.9k, avg=473933.49, stdev=176582.45
    clat percentiles (usec):
     |  1.00th=[     45],  5.00th=[ 358613], 10.00th=[ 367002],
     | 20.00th=[ 379585], 30.00th=[ 392168], 40.00th=[ 404751],
     | 50.00th=[ 425722], 60.00th=[ 455082], 70.00th=[ 497026],
     | 80.00th=[ 557843], 90.00th=[ 675283], 95.00th=[ 792724],
     | 99.00th=[1132463], 99.50th=[1283458], 99.90th=[1619002],
     | 99.95th=[1736442], 99.99th=[1803551]
   bw (  KiB/s): min=    7, max=  624, per=6.27%, avg=134.33, stdev=30.28, samples=964
   iops        : min=    1, max=  156, avg=33.52, stdev= 7.58, samples=964
  lat (usec)   : 50=1.48%, 100=0.19%, 250=0.04%
  lat (msec)   : 4=0.02%, 10=0.07%, 20=0.10%, 50=0.26%, 100=0.42%
  lat (msec)   : 250=0.77%, 500=67.80%, 750=22.40%, 1000=4.66%
  cpu          : usr=0.06%, sys=0.15%, ctx=16458, majf=0, minf=396
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=0.8%, 16=98.5%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16449,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=2144KiB/s (2196kB/s), 2144KiB/s-2144KiB/s (2196kB/s-2196kB/s), io=64.3MiB (67.4MB), run=30685-30685msec

Disk stats (read/write):
  sdd: ios=16447/0, merge=0/0, ticks=7742515/0, in_queue=7734446, util=55.87%